Hey @justinretzolk, I have the same issue in 1.5.6 as well. 

The plan looks correct, but the error shows up during apply.

```
  # module.test.module.test.module.test.module.core.module.eks_cluster.aws_eks_addon.addons["kube-proxy"] will be created
  + resource "aws_eks_addon" "addons" {
      + addon_name                  = "kube-proxy"
      + addon_version               = "v1.26.2-minimal-eksbuild.1"
      + arn                         = (known after apply)
      + cluster_name                = "test-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
 ```

```╷
│ Error: creating EKS Add-On (test-cluster:kube-proxy): InvalidParameterException: Addon version specified is not supported
│ {
│   RespMetadata: {
│     StatusCode: 400,
│     RequestID: "38f0807a-7759-4e27-beba-2068d32b7782"
│   },
│   AddonName: "test-cluster",
│   ClusterName: "kube-proxy",
│   Message_: "Addon version specified is not supported"
```